The active view
  Namespace:   Autodesk.Revit.UI
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2017
 Syntax
  C#
public View ActiveView { get; internal set; }
  Visual Basic
Public Property ActiveView As View
	Get
	Friend Set
  Visual C++
public:
property View^ ActiveView {
	View^ get ();
	internal: void set (View^ value);
}
 See Also
  FamilyInstancePlacingArgs Class
  Autodesk.Revit.UI Namespace